let handler = m => m;  

 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^انمي$/i.test(m.text)) { 
     responses = [ 
       '*كم مرة مات غوكو ؟*',
       '*ما اسم ام روبين التي ماتت ؟*',
       '*ما هوا اسم همستر لورا ؟*',
       '*من هوا اليد اليمنى لملك القراصنه ؟*',
       '*ما هوا لقب ريوزاكي في ديث نوت ؟*',
       '*كم مذكرة ظهرت في ديث نوت*',
       '*اول شخص استخدم تنفس الشمس ؟*',
       '*كيف مات ايتاتشي ؟*',
       '*من هو والد ناروتو؟*',
       '*ماذا كان اسم اوبيتو عندما كان خفيا في الاكاتسكي ؟*',
       '*من هي اضعف شخصية في طاقم قبعة القش حسب تصريح الكاتب ؟*',
       '*اصغر شخص ايقظ المانقيكو شارينغان ؟*',
       '*من هو الشخص الذي اعطي روحه لغارا ؟*',
       '*ما هو اسم التنفس الرئيسي لدي تانجيرو ؟*',
       '*ما اسم اخت تانيجرو ؟*',
       '*ما هو مشروب ليفاي المفضل ؟*',
       '*ما هو اسم والده ساشا ؟*',
       '*من قتل خدم عائله الزولديك ؟*',
       '*من اول شخص علم غون وكيلوا استخدام النين ؟*',
       '*ماذا كان لون سيف تانجيرو ؟*',
       '*اسم قائد الثيران السوداء ؟*',
       '*من هو امبراطور السحر لمملكة كلوفر ؟*',
       '*اسم قائد الفجر الذهبي ؟*',
       '*ما هو سحر يونو ؟*',
       '*اكلة ناروتو المفضلة ؟*',
       '*ماذا كان يعمل والد ايروين ؟*',
       '*من اي جيل اصحاب القدرات هو ميدوريا ؟*',
       '*"ما هو سحر القائد يامي ؟*',
       '*من القائد الذي لا يعرف اسم سيفه ؟*',

       ];
         }else if (/^اسئله$/i.test(m.text)) { 
         responses = [ 
        '*حسناً ⚡ قم بإختيار نوع الاسئله                          ╏📂↭╏دينيه  ╏📂↭╏انمي*',     
      
           ];
             }else if (/^دينيه$/i.test(m.text)) { 
             responses = [ 
               '*كم عدد السنوات التي نام فيها أهل الكهف؟*',
               '*سورة قصيرة من قرأها ثلاثا فكأنما قرأ كل القرآن؟*',
               '*من هو النبي الذي كانت إحدى معجزاته العصا التي تتحول إلى حية تسعى؟*',
               '*من هو النبي الملقب بالذبيح؟*',
               '*من هو النبي الذي أرسل إلى قوم ثمود؟*',
               '*الشهر الثامن في التقويم الهجري؟*',
               '*كم عدد آيات سورة البقرة؟*',
               '*كم عدد القراءات الصحيحة للقرآن الكريم؟*',
               '*من أول من لقب بأمير المؤمنين؟*',
               '*ما آخر سورة نزلت في مكة؟*',
               '*كم عدد السور التي ابتدأت بالحروف المقطعة (الم)؟*',
               '*في أي سورة وردت الآية التالية (ولبثوا في كهفهم ثلاث مئة سنين وازدادوا تسعا)؟*',
               '*ما هي أطول سورة في القرآن الكريم؟*',
               '*ما السورة التي ختمت باسم وقت من أوقات الصلاة؟*',
               '*كم مرة ذكرت السيدة مريم في القرآن الكريم؟*',
               '*ما هي السورة التي يطلق عليها أم الكتاب؟*',
               '*من الذي لقب الرسول الكريم بالطيب المطيب؟*',
               '*من أسماء الخيل التي ذكرت في القرآن الكريم؟*',
               '*كم مرة اعتمر النبي صلى الله عليه وسلم؟*',
               '*في أي عام هجري وقعت غزوة خيبر؟*',
               '*ما هي السورة التي لا تبدأ بالبسملة؟*',
               '*في أي سورة ذكرت قصة قابيل وهابيل؟*',
               '*كم كان عمر الرسول صلى الله عليه وسلم عندما بُعث؟*',
               '*ما هو العام الهجري الذي احتفل فيه المسلمين بعيد الفطر وعيد الأضحى المبارك؟*',
               '*كم كان عمر النبي صلى الله عليه وسلم حين وفاة زوجته خديجة بنت خويلد رضى الله عنها؟*',
               '*كم عدد التكبيرات في الركعة الأولى في صلاة العيد؟*',
               '*من هو الصحابي الجليل الذي كان مُلقباً بـأسد الله الغالب؟*',
               '*من هو أول نبي يقوم بقرع باب الجنّة يوم القيامة؟*',
               
             
             ];
               }else if (/^اسئلة$/i.test(m.text)) { 
               responses = [ 
              '*حسناً ⚡ قم بإختيار نوع الاسئله                          ╏📂↭╏دينيه  ╏📂↭╏انمي*',
                 
                 ];
                   }else if (/^دينية$/i.test(m.text)) { 
                   responses = [ 
                     '*كم عدد السنوات التي نام فيها أهل الكهف؟*',
                        '*سورة قصيرة من قرأها ثلاثا فكأنما قرأ كل القرآن؟*',
                        '*من هو النبي الذي كانت إحدى معجزاته العصا التي تتحول إلى حية تسعى؟*',
                        '*من هو النبي الملقب بالذبيح؟*',
                        '*من هو النبي الذي أرسل إلى قوم ثمود؟*',
                        '*الشهر الثامن في التقويم الهجري؟*',
                        '*كم عدد آيات سورة البقرة؟*',
                        '*كم عدد القراءات الصحيحة للقرآن الكريم؟*',
                        '*من أول من لقب بأمير المؤمنين؟*',
                        '*ما آخر سورة نزلت في مكة؟*',
                        '*كم عدد السور التي ابتدأت بالحروف المقطعة (الم)؟*',
                        '*في أي سورة وردت الآية التالية (ولبثوا في كهفهم ثلاث مئة سنين وازدادوا تسعا)؟*',
                        '*ما هي أطول سورة في القرآن الكريم؟*',
                        '*ما السورة التي ختمت باسم وقت من أوقات الصلاة؟*',
                        '*كم مرة ذكرت السيدة مريم في القرآن الكريم؟*',
                        '*ما هي السورة التي يطلق عليها أم الكتاب؟*',
                        '*من الذي لقب الرسول الكريم بالطيب المطيب؟*',
                        '*من أسماء الخيل التي ذكرت في القرآن الكريم؟*',
                        '*كم مرة اعتمر النبي صلى الله عليه وسلم؟*',
                        '*في أي عام هجري وقعت غزوة خيبر؟*',
                        '*ما هي السورة التي لا تبدأ بالبسملة؟*',
                        '*في أي سورة ذكرت قصة قابيل وهابيل؟*',
                        '*كم كان عمر الرسول صلى الله عليه وسلم عندما بُعث؟*',
                        '*ما هو العام الهجري الذي احتفل فيه المسلمين بعيد الفطر وعيد الأضحى المبارك؟*',
                        '*كم كان عمر النبي صلى الله عليه وسلم حين وفاة زوجته خديجة بنت خويلد رضى الله عنها؟*',
                        '*كم عدد التكبيرات في الركعة الأولى في صلاة العيد؟*',
                        '*من هو الصحابي الجليل الذي كان مُلقباً بـأسد الله الغالب؟*',
                        '*من هو أول نبي يقوم بقرع باب الجنّة يوم القيامة؟*',
               
               ];     
     }
       if (responses) { 
          let randomIndex = Math.floor(Math.random() * responses.length); 
          conn.reply(m.chat, responses[randomIndex], m); 
        } 
        return !0 
       }; 

       export default handler;
